## Filtering Dataframe

In [37]:
import numpy as np
import pandas as pd

In [38]:
titanic_df = pd.read_csv("Titanic_data.csv")

In [39]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Condition Based Filtering

In [40]:
titanic_df["Fare"]

0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
886    13.0000
887    30.0000
888    23.4500
889    30.0000
890     7.7500
Name: Fare, Length: 891, dtype: float64

In [41]:
titanic_df.Fare

0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
886    13.0000
887    30.0000
888    23.4500
889    30.0000
890     7.7500
Name: Fare, Length: 891, dtype: float64

In [60]:
mask1 = titanic_df["Fare"]==100
fare_100 = titanic_df[mask1]

In [61]:
fare_100.shape

(0, 12)

In [67]:
female = titanic_df[
(titanic_df["Sex"] == "female")
]

female.shape

(314, 12)

In [64]:
female_100 = titanic_df[
(titanic_df["Fare"]>100) & (titanic_df["Sex"] == "female")
]

In [65]:
female_100.shape

(34, 12)

In [54]:
314/891

0.35241301907968575

In [83]:
titanic_df["Survived"]

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [89]:
survived = titanic_df[
    titanic_df['Survived'] == 1
]
survived.shape

(342, 12)

In [96]:
survived = titanic_df[
    titanic_df['Survived'] == 1
]
survived.shape

survived_male = titanic_df[
(titanic_df["Survived"]==1) & (titanic_df["Sex"] == "male")
]
survived_male.shape
survived_per = (109/342)*100
print(f"Survived percentage of male is {survived_per}%.")
print(f"Survived percentage of female is {100-survived_per}%.")

Survived percentage of male is 31.871345029239766%.
Survived percentage of female is 68.12865497076024%.

In [91]:
survived = titanic_df[
    titanic_df['Survived'] == 1
]

survived_female = titanic_df[
    (titanic_df['Survived'] == 1) & (titanic_df['Sex'] == 'female')
]
survived_male = titanic_df[
    (titanic_df['Survived'] == 1) & (titanic_df['Sex'] == 'male')
]

In [94]:
#Compiled
titanic_df= pd.read_csv("Titanic_data.csv")
survived= titanic_df["Survived"] == 1
survived= titanic_df[survived]
print("Total survived:", survived.shape)
survived_male= titanic_df[
            (titanic_df["Survived"] == 1) & (titanic_df["Sex"]== "male")
        ]
print("Survived Male:", survived_male.shape )
survived_female= titanic_df[
            (titanic_df["Survived"] == 1) & (titanic_df["Sex"]== "female")
]
print("Survived female:", survived_female.shape )

Total survived: (342, 12)
Survived Male: (109, 12)
Survived female: (233, 12)

## Filtering using existing methods

In [99]:
titanic_df['Cabin'].isna() #returns true to those which are empty

0       True
1      False
2       True
3      False
4       True
       ...
886     True
887    False
888     True
889    False
890     True
Name: Cabin, Length: 891, dtype: bool

In [105]:
titanic_df[titanic_df['Cabin'].notna()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

**Filter using index**
--

In [109]:
titanic_df.loc[0,"Name"]

'Braund, Mr. Owen Harris'

In [110]:
titanic_df.loc[:10,"Name"]

0                               Braund, Mr. Owen Harris
1     Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                Heikkinen, Miss. Laina
3          Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                              Allen, Mr. William Henry
5                                      Moran, Mr. James
6                               McCarthy, Mr. Timothy J
7                        Palsson, Master. Gosta Leonard
8     Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                   Nasser, Mrs. Nicholas (Adele Achem)
10                      Sandstrom, Miss. Marguerite Rut
Name: Name, dtype: object

In [111]:
titanic_df.at[0,"Name"]

'Braund, Mr. Owen Harris'